<template>
  <div class="relative h-screen w-full overflow-auto custom-scroll">
    <div
      class="bg-indigo-200 py-2.5 flex justify-between px-6 fixed w-full md:hidden"
    >
      <router-link
        :to="{ name: 'Employee' }"
        class="menu-item w-8 h-8 lg:w-12 lg:h-12 text-violet-800"
      >
        <svg
          class="fill-current"
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 24 24"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M8.491 0c6.131 0 6.538.02 7.087.342.844.496 1.145 1.186 1.145 2.627l-.021.321-5.24.064c-5.092.062-5.88.461-6.443.797-.328.195-.929.945-1.038 1.246-.125.345-.82 2.587-.62 5.773l.31 4.99-.627-.044c-.987 0-1.465-.086-1.9-.342C.007 15.106-.001 15.047 0 8.024c0-6.07.017-6.386.367-6.94C1.032.034 1.285 0 8.491 0Zm12.113 7.742s2.163.22 2.79.85l.537.54.052 6.461c.058 7.18.028 7.398-1.087 8.053-.574.337-.902.354-7.237.354-6.26 0-6.668-.02-7.217-.342-.844-.496-1.066-.758-1.1-2.199a7.46 7.46 0 0 0-.037-.592l-.053.001c.01-.298.031-.212.053-.001l5.09-.128c5.666-.141 6.752-.538 7.376-1.456.298-.437.875-1.682.956-6.395l-.123-5.146Zm-7.352.14h3.471v6.839l-.621.654-.623.654-3.652.055c-3.11.046-3.666.014-3.755-.21-.058-.144-.078-1.626-.045-3.294.052-2.595.111-3.112.404-3.58.655-1.042.983-1.118 4.821-1.118Z"
          />
        </svg>
      </router-link>
      <button
        class="menu-item w-8 h-8 lg:hidden text-violet-800"
        @click="showMenu = !showMenu"
      >
        <svg
          v-if="showMenu"
          fill="none"
          class="stroke-current w-3 h-3"
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 14 14"
        >
          <path
            d="M1 13 13 1M13 13 1 1"
            stroke-width="1.5"
            stroke-linecap="round"
          />
        </svg>
        <svg
          v-else
          class="fill-current w-4 h-3"
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 16 12"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M15.75 6a.75.75 0 0 0-.75-.75H1a.75.75 0 0 0 0 1.5h14a.75.75 0 0 0 .75-.75ZM15.75 1A.75.75 0 0 0 15 .25H1a.75.75 0 1 0 0 1.5h14a.75.75 0 0 0 .75-.75ZM15.75 11a.75.75 0 0 0-.75-.75H1a.75.75 0 0 0 0 1.5h14a.75.75 0 0 0 .75-.75Z"
          />
        </svg>
      </button>
      <transition name="slide-right">
        <div
          class="absolute bg-white inset-x-0 px-6 w-full top-full bg-white z-10 lg:block-important lg:relative lg:inset-0 h-screen overflow-hidden lg:bg-transparent lg:px-0"
          v-show="showMenu"
        >
          <div
            class="mt-7.5 relative lg:mt-36 lg:pb-36 lg:h-full lg:flex lg:flex-col"
          >
            <router-link
              :to="{ name: 'Home' }"
              class="flex items-center justify-center h-17.5 hover:bg-violet-800 rounded-lg font-semibold transition hover:text-white"
            >
              Контакты
            </router-link>
            <div class="h-1"></div>
            <router-link
              :to="{ name: 'Employee' }"
              class="flex items-center h-17.5 bg-violet-800 rounded-lg font-semibold transition justify-center text-white"
            >
              Войти
            </router-link>
          </div>
        </div>
      </transition>
    </div>

    <div class="md:p-3 mt-18 md:mt-0">
      <div
        class="hidden md:flex justify-between items-center gap-12.5 max-w-1687 mx-auto bg-white rounded-xl px-12 py-6 shadow-sm"
      >
        <router-link
          :to="{ name: 'Home' }"
          class="inline-flex gap-4 items-center text-violet-800"
        >
          <svg
            class="fill-current w-9"
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M8.491 0c6.131 0 6.538.02 7.087.342.844.496 1.145 1.186 1.145 2.627l-.021.321-5.24.064c-5.092.062-5.88.461-6.443.797-.328.195-.929.945-1.038 1.246-.125.345-.82 2.587-.62 5.773l.31 4.99-.627-.044c-.987 0-1.465-.086-1.9-.342C.007 15.106-.001 15.047 0 8.024c0-6.07.017-6.386.367-6.94C1.032.034 1.285 0 8.491 0Zm12.113 7.742s2.163.22 2.79.85l.537.54.052 6.461c.058 7.18.028 7.398-1.087 8.053-.574.337-.902.354-7.237.354-6.26 0-6.668-.02-7.217-.342-.844-.496-1.066-.758-1.1-2.199a7.46 7.46 0 0 0-.037-.592l-.053.001c.01-.298.031-.212.053-.001l5.09-.128c5.666-.141 6.752-.538 7.376-1.456.298-.437.875-1.682.956-6.395l-.123-5.146Zm-7.352.14h3.471v6.839l-.621.654-.623.654-3.652.055c-3.11.046-3.666.014-3.755-.21-.058-.144-.078-1.626-.045-3.294.052-2.595.111-3.112.404-3.58.655-1.042.983-1.118 4.821-1.118Z"
            />
          </svg>

          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="205"
            fill="none"
            viewBox="0 0 205 27"
          >
            <path
              fill="#51459D"
              d="M17.619 6.56c0 1.085-.221 2.02-.663 2.806a5.242 5.242 0 0 1-1.801 1.898c-.795.506-1.705.872-2.73 1.097-1.015.226-2.158.34-3.43.34H7.458v5.407c0 .326.058.61.172.854.124.235.354.425.69.57.176.072.463.149.86.23.398.081.733.136 1.007.163v1.057H0v-1.057l1.02-.109c.424-.054.72-.117.888-.19.344-.144.57-.32.675-.528.115-.208.172-.497.172-.868V4.663c0-.317-.053-.588-.159-.814-.106-.235-.335-.429-.688-.582a4.878 4.878 0 0 0-.994-.285c-.406-.09-.71-.15-.914-.176V1.748h10.373c2.428 0 4.243.398 5.444 1.193 1.201.786 1.802 1.993 1.802 3.62Zm-5.167.692c0-1.446-.287-2.517-.86-3.213-.566-.705-1.577-1.057-3.034-1.057h-1.1v8.444h.557c1.448 0 2.547-.339 3.298-1.016.76-.687 1.14-1.74 1.14-3.158ZM32.071 10.017c0 .686-.207 1.292-.622 1.816-.415.515-.963.772-1.643.772-.645 0-1.192-.167-1.643-.501-.441-.334-.662-.827-.662-1.477 0-.317.022-.56.066-.732l.12-.502c-.407.018-.835.163-1.285.434a4.26 4.26 0 0 0-1.193 1.084v7.441c0 .317.049.579.146.787.097.207.26.37.49.488.195.099.508.185.94.257.442.063.76.1.955.108v.99h-8.863v-.99c.221-.018.442-.04.663-.067.23-.036.424-.082.582-.136.283-.1.477-.253.583-.46.106-.209.16-.48.16-.814v-7.889c0-.325-.076-.614-.226-.867a1.954 1.954 0 0 0-.543-.623 2.153 2.153 0 0 0-.61-.272 4.028 4.028 0 0 0-.794-.149v-.99l6.319-.352.198.204v1.965h.053c.61-.723 1.254-1.287 1.934-1.694.69-.416 1.405-.624 2.146-.624.822 0 1.48.262 1.974.787.504.515.755 1.183.755 2.006ZM46.524 9.136a6.222 6.222 0 0 1 1.497 2.236c.344.867.517 1.807.517 2.82a7.854 7.854 0 0 1-.517 2.846 6.163 6.163 0 0 1-1.484 2.277 7.093 7.093 0 0 1-2.503 1.558c-.963.362-2.067.543-3.312.543-1.078 0-2.071-.159-2.98-.475a6.97 6.97 0 0 1-2.398-1.423 6.463 6.463 0 0 1-1.59-2.236c-.389-.895-.583-1.893-.583-2.996 0-1.084.168-2.046.503-2.887a6.565 6.565 0 0 1 1.537-2.263c.654-.633 1.457-1.12 2.411-1.464.963-.353 2.036-.529 3.219-.529 1.236 0 2.323.176 3.259.529.945.343 1.753.831 2.424 1.464Zm-3.391 9.393c.194-.506.335-1.12.424-1.844.097-.723.145-1.563.145-2.52 0-.633-.044-1.356-.132-2.17-.088-.813-.22-1.454-.398-1.924-.211-.57-.507-1.017-.887-1.342-.37-.325-.843-.488-1.417-.488-.628 0-1.13.176-1.51.529-.372.352-.659.808-.862 1.369-.185.515-.313 1.12-.384 1.816-.07.687-.106 1.405-.106 2.155 0 .985.031 1.803.093 2.453a7.79 7.79 0 0 0 .45 1.939c.203.56.495 1.003.875 1.328.38.325.86.488 1.444.488.53 0 .984-.15 1.364-.448.38-.307.68-.754.9-1.341ZM76.569 20.982h-7.896v-.99c.195-.027.398-.05.61-.067.212-.018.388-.064.53-.136a.647.647 0 0 0 .37-.447 3.57 3.57 0 0 0 .08-.827v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.378-.705-.38 0-.72.063-1.02.19-.291.117-.56.266-.808.447-.256.19-.455.38-.596.57a34.1 34.1 0 0 0-.358.487v7.279c0 .325.036.592.106.8.08.198.221.357.424.474.141.081.3.154.477.217.185.063.38.108.583.136v.989h-7.564v-.99l.61-.067c.238-.027.414-.073.529-.136a.69.69 0 0 0 .358-.434c.061-.19.092-.47.092-.84v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.377-.705-.38 0-.72.063-1.02.19-.292.117-.561.266-.809.447-.256.19-.454.38-.596.57-.141.19-.26.352-.357.487v7.279c0 .316.04.578.119.786.08.208.22.37.424.488.141.081.3.154.477.217.185.063.38.108.583.136v.989h-7.936v-.99c.23-.018.455-.04.676-.067.22-.027.41-.073.57-.136.282-.108.477-.262.583-.46.106-.209.159-.48.159-.814v-7.889c0-.289-.076-.569-.226-.84a1.882 1.882 0 0 0-.543-.65 2.153 2.153 0 0 0-.61-.272 4.027 4.027 0 0 0-.794-.149v-.99l6.319-.352.199.204v1.91h.053l.874-.799c.344-.316.667-.569.967-.759.327-.217.746-.397 1.258-.542a6.178 6.178 0 0 1 1.683-.217c1.007 0 1.846.226 2.517.678a3.61 3.61 0 0 1 1.444 1.775h.119c.256-.243.57-.528.94-.853.371-.335.712-.601 1.02-.8.345-.226.782-.416 1.312-.57a6.253 6.253 0 0 1 1.722-.23c1.334 0 2.358.402 3.074 1.207.724.804 1.086 1.947 1.086 3.429v6.587c0 .334.048.605.145.813.098.2.274.353.53.461a3.9 3.9 0 0 0 1.245.325v.99Z"
            />
            <path
              fill="#51459D"
              d="M98.347 20.982h-10.24v-1.057a13.18 13.18 0 0 0 1.682-.258c.645-.144.967-.32.967-.528 0-.073-.008-.154-.026-.244a1.427 1.427 0 0 0-.106-.366l-1.603-3.985H82.53c-.15.37-.318.804-.504 1.3-.176.498-.33.94-.463 1.33-.168.505-.27.871-.305 1.097-.026.226-.04.384-.04.474 0 .29.212.538.636.746.433.199 1.148.343 2.146.434v1.057h-7.71v-1.057c.292-.018.619-.064.98-.136.372-.081.663-.19.875-.325.362-.217.667-.484.914-.8.256-.316.468-.691.636-1.125 1.024-2.539 2.049-5.083 3.073-7.63l3.418-8.432h2.65c1.73 4.356 3.086 7.799 4.066 10.329.98 2.53 1.815 4.626 2.504 6.289.115.271.26.52.437.745.177.217.429.425.755.624.248.144.535.253.862.325.326.072.622.118.887.136v1.057Zm-9.87-7.78L85.75 6.235l-2.69 6.967h5.419ZM105.951 21.416c-1.228 0-2.314-.181-3.259-.543-.936-.37-1.709-.872-2.318-1.504a6.156 6.156 0 0 1-1.365-2.277c-.3-.877-.45-1.83-.45-2.86 0-.94.181-1.834.543-2.684.371-.85.87-1.595 1.497-2.236.645-.66 1.444-1.184 2.398-1.573.962-.397 2.022-.596 3.179-.596 1.625 0 2.91.316 3.855.949.945.623 1.417 1.468 1.417 2.534 0 .651-.167 1.175-.503 1.573-.336.397-.914.596-1.735.596-.663 0-1.219-.162-1.669-.488-.442-.325-.663-.75-.663-1.274 0-.443.071-.88.212-1.315.141-.433.225-.763.252-.99a.969.969 0 0 0-.371-.365c-.15-.09-.384-.136-.702-.136-.398 0-.76.095-1.086.285-.327.19-.632.524-.914 1.003-.274.452-.495 1.057-.663 1.816-.159.76-.238 1.672-.238 2.738 0 1.609.366 2.905 1.099 3.89.742.985 1.625 1.478 2.65 1.478.98 0 1.757-.222 2.331-.664.583-.452 1.1-1.09 1.55-1.912l.994.705a7.91 7.91 0 0 1-.981 1.518 6.365 6.365 0 0 1-1.364 1.207c-.557.37-1.122.65-1.696.84-.574.19-1.241.285-2 .285ZM127.941 20.697c-.388.172-.848.33-1.378.475a6.355 6.355 0 0 1-1.682.217c-1.086 0-1.885-.163-2.398-.488-.512-.335-.861-.81-1.046-1.424h-.08c-.3.308-.591.57-.874.787a4.77 4.77 0 0 1-.888.555 5.87 5.87 0 0 1-1.205.434c-.38.1-.914.15-1.603.15-1.024 0-1.899-.308-2.623-.923-.724-.623-1.086-1.445-1.086-2.466 0-.588.079-1.085.238-1.491.159-.416.384-.782.676-1.098.265-.29.57-.529.914-.719.353-.19.737-.366 1.152-.528a37.344 37.344 0 0 1 2.862-.922c1.113-.325 1.925-.614 2.437-.867v-1.302c0-.226-.017-.524-.053-.894a2.934 2.934 0 0 0-.225-.935 1.775 1.775 0 0 0-.583-.732c-.265-.2-.614-.299-1.046-.299-.389 0-.716.06-.981.177a3.066 3.066 0 0 0-.622.338c.026.181.101.457.225.827.124.37.186.728.186 1.071 0 .154-.04.348-.12.583a1.287 1.287 0 0 1-.344.542c-.203.18-.433.32-.689.42-.247.1-.631.15-1.152.15-.742 0-1.303-.181-1.683-.543-.38-.37-.57-.85-.57-1.437 0-.506.195-.957.583-1.355a4.852 4.852 0 0 1 1.444-1.003 7.927 7.927 0 0 1 1.921-.624 9.751 9.751 0 0 1 2.014-.23c.856 0 1.642.054 2.358.163.715.1 1.36.311 1.934.637.547.316.98.777 1.298 1.382.327.597.49 1.378.49 2.345 0 1.021-.022 2.232-.066 3.633-.035 1.4-.053 2.322-.053 2.765 0 .406.057.727.172.962.124.235.309.411.557.529.15.072.384.117.702.135.326.01.622.014.887.014v.99Zm-6.584-7.061c-.494.171-.984.37-1.47.596a5.628 5.628 0 0 0-1.192.691 2.607 2.607 0 0 0-.769.976c-.185.389-.278.85-.278 1.383 0 .704.155 1.215.464 1.531a1.59 1.59 0 0 0 1.166.475c.485 0 .883-.1 1.192-.299.318-.207.596-.46.834-.759l.053-4.595ZM146.09 20.697l-6.531.393-.199-.19v-1.246l-.092-.027c-.433.478-1.021.899-1.762 1.26a5.09 5.09 0 0 1-2.226.529c-1.784 0-3.254-.678-4.411-2.034-1.157-1.355-1.736-3.108-1.736-5.259 0-1.906.645-3.542 1.935-4.906 1.298-1.365 2.865-2.047 4.702-2.047a7.8 7.8 0 0 1 2.04.258c.636.162 1.144.357 1.524.583V3.578a2.21 2.21 0 0 0-.199-.935 1.677 1.677 0 0 0-.53-.691c-.274-.199-.618-.339-1.033-.42a9.435 9.435 0 0 0-1.232-.19v-.99L143.493 0l.199.217v17.77c0 .343.053.632.159.867.115.235.296.42.543.556.186.099.455.171.808.216.362.046.658.073.888.082v.99Zm-6.756-2.412v-7.659a5.473 5.473 0 0 0-.265-.69 2.686 2.686 0 0 0-.451-.72 2.36 2.36 0 0 0-.715-.5 2.205 2.205 0 0 0-.993-.218c-.884 0-1.608.511-2.173 1.532s-.848 2.463-.848 4.324c0 .732.049 1.392.146 1.979a5.41 5.41 0 0 0 .543 1.586c.256.479.583.854.98 1.125.407.27.892.406 1.458.406.538 0 .984-.104 1.337-.311.354-.217.68-.502.981-.854ZM161.192 17.742a8.282 8.282 0 0 1-1.126 1.464c-.433.452-.928.84-1.484 1.166-.592.343-1.192.6-1.802.773-.6.18-1.294.27-2.08.27-1.307 0-2.437-.19-3.391-.569-.945-.38-1.726-.89-2.345-1.531a6.236 6.236 0 0 1-1.39-2.264 8.708 8.708 0 0 1-.451-2.846c0-.922.163-1.803.49-2.643a7.205 7.205 0 0 1 1.418-2.264c.6-.641 1.355-1.16 2.265-1.559.918-.397 1.943-.596 3.073-.596 1.237 0 2.252.154 3.047.46.795.308 1.453.733 1.974 1.275.503.515.87 1.125 1.1 1.83.229.696.344 1.428.344 2.196v.88h-8.955c0 1.853.349 3.263 1.046 4.23.698.966 1.806 1.45 3.325 1.45.831 0 1.577-.23 2.239-.691a6.551 6.551 0 0 0 1.696-1.776l1.007.745Zm-5.061-5.15c0-.542-.026-1.098-.079-1.667-.053-.57-.146-1.035-.278-1.396-.151-.425-.358-.746-.623-.963-.256-.217-.583-.325-.98-.325-.68 0-1.224.352-1.63 1.057-.406.705-.627 1.821-.662 3.348l4.252-.054ZM188.799 20.982h-7.896v-.99a11.6 11.6 0 0 1 .61-.067c.212-.018.388-.064.53-.136a.648.648 0 0 0 .371-.447c.053-.217.079-.493.079-.827v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.378-.705-.38 0-.72.063-1.02.19a3.724 3.724 0 0 0-.808.447 2.85 2.85 0 0 0-.596.57c-.141.19-.261.352-.358.487v7.279c0 .325.036.592.106.8.08.198.221.357.424.474.141.081.3.154.477.217.186.063.38.108.583.136v.989h-7.564v-.99l.609-.067c.239-.027.415-.073.53-.136a.688.688 0 0 0 .358-.434c.062-.19.092-.47.092-.84v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.377-.705-.38 0-.72.063-1.02.19a3.701 3.701 0 0 0-.808.447c-.257.19-.455.38-.597.57-.141.19-.26.352-.357.487v7.279c0 .316.039.578.119.786a.94.94 0 0 0 .424.488c.141.081.3.154.477.217.185.063.38.108.583.136v.989h-7.935v-.99c.229-.018.454-.04.675-.067.221-.027.411-.073.57-.136.282-.108.477-.262.583-.46.106-.209.159-.48.159-.814v-7.889c0-.289-.075-.569-.226-.84a1.88 1.88 0 0 0-.543-.65 2.154 2.154 0 0 0-.609-.272 4.015 4.015 0 0 0-.795-.149v-.99l6.319-.352.199.204v1.91h.053l.874-.799c.344-.316.667-.569.967-.759.327-.217.746-.397 1.259-.542a6.176 6.176 0 0 1 1.682-.217c1.007 0 1.846.226 2.517.678a3.612 3.612 0 0 1 1.444 1.775h.119c.256-.243.57-.528.941-.853a8.15 8.15 0 0 1 1.02-.8c.344-.226.781-.416 1.311-.57a6.256 6.256 0 0 1 1.722-.23c1.334 0 2.358.402 3.074 1.207.724.804 1.086 1.947 1.086 3.429v6.587c0 .334.048.605.146.813.097.2.273.353.529.461.142.063.314.127.517.19.212.063.455.108.729.136v.989ZM205 8.526a3.036 3.036 0 0 0-1.166.46c-.371.244-.68.624-.927 1.139a229.571 229.571 0 0 0-2.345 5.259 381.617 381.617 0 0 1-2.676 6.018c-.547 1.211-1.077 2.178-1.589 2.9-.513.724-.994 1.28-1.444 1.668-.424.361-.844.623-1.259.786a3.42 3.42 0 0 1-1.258.244c-.839 0-1.519-.24-2.04-.718-.513-.48-.769-1.017-.769-1.613 0-.253.027-.488.08-.705.062-.217.185-.443.371-.678.141-.199.357-.37.649-.515.3-.136.636-.203 1.007-.203.494 0 .967.176 1.417.528.45.353.919.84 1.404 1.464.292-.298.649-.745 1.073-1.342a6.402 6.402 0 0 0 .954-1.816 314.626 314.626 0 0 0-2.795-5.869 1870.85 1870.85 0 0 0-2.729-5.557 2.495 2.495 0 0 0-.888-1.003 2.772 2.772 0 0 0-1.179-.447v-.99h8.108v.99a3.908 3.908 0 0 0-1.047.203c-.388.126-.583.29-.583.488 0 .072.014.153.04.244.027.081.075.203.146.366.3.632.724 1.513 1.272 2.643.556 1.12 1.201 2.435 1.934 3.944a309.049 309.049 0 0 0 1.391-3.307c.388-.93.763-1.843 1.126-2.738.088-.226.136-.402.145-.529.018-.135.027-.226.027-.27 0-.163-.08-.303-.239-.42a2.132 2.132 0 0 0-.543-.326 3.959 3.959 0 0 0-.636-.204 6.409 6.409 0 0 0-.503-.094v-.99H205v.99Z"
            />
          </svg>
        </router-link>

        <router-link
          :to="{ name: 'Home' }"
          class="ml-auto font-semibold hover:text-gray-700 transition underline text-lg xl:text-2xl text-gray-500"
          >Контакты</router-link
        >
        <button
          class="h-10.5 rounded-xl text-lg w-148 text-center bg-violet-800 text-white font-bold"
        >
          Войти
        </button>
      </div>
      <div
        class="max-w-1687 mx-auto bg-white rounded-xl shadow-sm mt-5 xl:mt-6 p-6.5 md:px-25 xl:px-200 md:py-11 text-center"
      >
        <div class="md:flex flex-row-reverse items-center md:gap-10 xl:gap-20">
          <img
            src="@/assets/img/home-banner.png"
            class="w-full h-auto md:w-1/2"
            alt=""
          />
          <div
            class="border-b border-indigo-300 md:w-1/2 pb-12.5 md:border-0 md:text-left xl:pt-20"
          >
            <h1
              class="text-2xl md:text-3xl xl:text-55 font-extrabold leading-6 xl:leading-tight"
            >
              Академия <br />
              технических знаний
            </h1>
            <p class="text-sm leading-snug mt-4 xl:text-lg">
              Повышаем доступность знаний и делаем процесс развития специалистов
              простым и управляемым
            </p>
            <button
              class="h-10.5 rounded-xl xl:text-lg text-base px-11 mt-7.5 xl:mt-11 xl:px-9 text-center bg-violet-800 text-white font-bold"
            >
              Наша миссия
            </button>
          </div>
        </div>
        <div class="lg:flex items-center md:gap-4 xl:gap-10 lg:mt-6 xl:mt-15">
          <div class="mt-12.5 lg:mt-0 flex items-center">
            <div
              class="w-30 xl:w-36 flex-shrink-0 flex flex-col pr-4 items-center justify-center"
            >
              <img src="@/assets/img/home-feature-1.png" alt="" />
            </div>
            <div class="text-left">
              <h4 class="font-extrabold leading-tight">
                Обучение и переподготовка
              </h4>
              <p class="text-sm leading-snug mt-2">
                Обучение новой профессии "с нуля" или переподготовка кадров
              </p>
            </div>
          </div>
          <div class="mt-12.5 lg:mt-0 flex items-center">
            <div
              class="w-30 xl:w-36 flex-shrink-0 flex flex-col pr-4 items-center justify-center"
            >
              <img src="@/assets/img/home-feature-2.png" alt="" />
            </div>
            <div class="text-left">
              <h4 class="font-extrabold leading-tight">
                Повышение квалификации
              </h4>
              <p class="text-sm leading-snug mt-2">
                Повышение на производстве или дополнительное проф. образование
              </p>
            </div>
          </div>
          <div class="mt-12.5 lg:mt-0 flex items-center">
            <div
              class="w-30 xl:w-36 flex-shrink-0 flex flex-col pr-4 items-center justify-center"
            >
              <img src="@/assets/img/home-feature-3.png" alt="" />
            </div>
            <div class="text-left">
              <h4 class="font-extrabold leading-tight">Профориентация</h4>
              <p class="text-sm leading-snug mt-2">
                Выбор правильного пути развития для молодых специалистов
              </p>
            </div>
          </div>
        </div>
      </div>

      <div class="max-w-1687 mx-auto mt-5 xl:mt-11">
        <h2
          class="font-extrabold text-2xl lg:text-3xl px-6.5 xl:p-0 leading-tight"
        >
          Основные компоненты системы
        </h2>

        <div
          class="grid grid-cols-1 md:grid-cols-2 gap-5 md:gap-4 mt-5 xl:grid-cols-3"
        >
          <div
            class="bg-white rounded-xl shadow-sm py-10 px-6.5 xl:px-12 xl:justify-between xl:flex xl:flex-col xl:items-start"
          >
            <div class="xl:flex xl:flex-col-reverse">
              <h3 class="text-xl font-extrabold xl:mt-6 leading-tight">
                Вводное тестирование
                <span class="block text-violet-800">#skillTest</span>
              </h3>
              <img
                src="@/assets/img/component-1.png"
                class="w-full h-auto mt-10 xl:mt-0 xl:h-full xl:w-auto xl:object-contain"
              />
            </div>
            <p class="mt-9 text-sm leading-snug xl:text-base xl:mt-4">
              Быстрый тест/опрос на основании которого определяется уровень
              подготовки участников курса и выявляются пробелы в знаниях, для
              адаптации учебной программы и достижения поставленных целей.
              (Может быть проведен в online-формате)
            </p>
            <button
              @click="showModal"
              class="bg-indigo-200 rounded-xl h-9 font-semibold mt-7.5 text-sm px-9"
            >
              Подробнее
            </button>
          </div>
          <div
            class="bg-white rounded-xl shadow-sm py-10 px-6.5 xl:px-12 xl:justify-between xl:flex xl:flex-col xl:items-start"
          >
            <div class="xl:flex xl:flex-col-reverse">
              <h3 class="text-xl font-extrabold xl:mt-6 leading-snug">
                Модульный курс
                <span class="block text-violet-800">#skillTest</span>
              </h3>
              <img
                src="@/assets/img/component-2.png"
                class="w-full h-auto mt-10 xl:mt-0 xl:h-full xl:w-auto xl:object-contain"
              />
            </div>
            <p class="mt-9 text-sm leading-snug xl:text-base xl:mt-4">
              Модульные курсы» состоят из набора определенных компетенций
              (модулей), необходимых для работы по выбранной профессии. Курс
              подбирается и проводится с учетом "Вводного теста" и требований
              предъявляемых Заказчиком.
            </p>
            <button
              @click="showModal"
              class="bg-indigo-200 rounded-xl h-9 font-semibold mt-7.5 text-sm px-9"
            >
              Подробнее
            </button>
          </div>
          <div
            class="bg-white rounded-xl shadow-sm py-10 px-6.5 xl:px-12 xl:justify-between xl:flex xl:flex-col xl:items-start"
          >
            <div class="xl:flex xl:flex-col-reverse">
              <h3 class="text-xl font-extrabold xl:mt-6 leading-snug">
                Экзамен и оценка знаний
                <span class="block text-violet-800">#skillTest</span>
              </h3>
              <img
                src="@/assets/img/component-3.png"
                class="w-full h-auto mt-10 xl:mt-0 xl:h-full xl:w-auto xl:object-contain"
              />
            </div>
            <p class="mt-9 text-sm leading-snug xl:text-base xl:mt-4">
              Экзамен по системе SkillsPass позволяет произвести проверку знаний
              и получить в наглядной форме подробный отчет. Каждая из
              компетенций проверятся отдельно от остальных, что позволяет
              получить максимально достоверную оценку.
            </p>
            <button
              @click="showModal"
              class="bg-indigo-200 rounded-xl h-9 font-semibold mt-7.5 text-sm px-9"
            >
              Подробнее
            </button>
          </div>
          <div
            class="bg-white rounded-xl shadow-sm py-10 px-6.5 xl:px-12 xl:justify-between xl:flex xl:flex-col xl:items-start"
          >
            <div class="xl:flex xl:flex-col-reverse">
              <h3 class="text-xl font-extrabold xl:mt-6 leading-snug">
                Сравнительная таблица
                <span class="block text-violet-800">#skillTest</span>
              </h3>
              <img
                src="@/assets/img/component-4.png"
                class="w-full h-auto mt-10 xl:mt-0 xl:h-full xl:w-auto xl:object-contain"
              />
            </div>
            <p class="mt-9 text-sm leading-snug xl:text-base xl:mt-4">
              Имея возможность сравнивать уровень подготовки специалистов не
              только между собой, но и с мировым стандартом вы получаете хороший
              инструмент для их развития и повышения эффективности.
            </p>
            <button
              @click="showModal"
              class="bg-indigo-200 rounded-xl h-9 font-semibold mt-7.5 text-sm px-9"
            >
              Подробнее
            </button>
          </div>
          <div
            class="bg-white rounded-xl shadow-sm py-10 px-6.5 xl:px-12 xl:justify-between xl:flex xl:flex-col xl:items-start"
          >
            <div class="xl:flex xl:flex-col-reverse">
              <h3 class="text-xl font-extrabold xl:mt-6 leading-snug">
                Подбор курсов
                <span class="block text-violet-800">#skillTest</span>
              </h3>
              <img
                src="@/assets/img/component-5.png"
                class="w-full h-auto mt-10 xl:mt-0 xl:h-full xl:w-auto xl:object-contain"
              />
            </div>
            <p class="mt-9 text-sm leading-snug xl:text-base xl:mt-4">
              Подбор курсов и распределение участников по группам с равноценным
              уровнем знаний на основании, определенных Заказчиком критериев и
              хранящихся в системе данных о сотрудниках.
            </p>
            <button
              @click="showModal"
              class="bg-indigo-200 rounded-xl h-9 font-semibold mt-7.5 text-sm px-9"
            >
              Подробнее
            </button>
          </div>
          <div
            class="bg-white rounded-xl shadow-sm py-10 px-6.5 xl:px-12 xl:justify-between xl:flex xl:flex-col xl:items-start"
          >
            <div class="xl:flex xl:flex-col-reverse">
              <h3 class="text-xl font-extrabold xl:mt-6 leading-snug">
                Планирование обучений
                <span class="block text-violet-800">#skillTest</span>
              </h3>
              <img
                src="@/assets/img/component-6.png"
                class="w-full h-auto mt-10 xl:mt-0 xl:h-full xl:w-auto xl:object-contain"
              />
            </div>
            <p class="mt-9 text-sm leading-snug xl:text-base xl:mt-4">
              Система позволяет хранить данные о пройденных сотрудниками курсах
              и обучениях, контролировать их усвоение и производить планирование
              новых.
            </p>
            <button
              @click="showModal"
              class="bg-indigo-200 rounded-xl h-9 font-semibold mt-7.5 text-sm px-9"
            >
              Подробнее
            </button>
          </div>
        </div>
      </div>

      <div class="max-w-1687 mx-auto mt-5 xl:mt-11">
        <div class="mt-10 pb-20 lg:pb-0">
          <div class="flex items-center justify-between px-6.5 xl:p-0">
            <h2 class="font-extrabold text-2xl lg:text-3xl leading-tight">
              Новости
            </h2>
            <div class="flex items-center gap-4">
              <button
                @click="prevSlide"
                class="hove:bg-indigo-400 w-8 h-8 flex flex-col items-center justify-center text-white border-2 border-white bg-indigo-200 rounded-full"
              >
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  class="fill-current h-2.5"
                  viewBox="0 0 7 12"
                >
                  <path
                    fill-rule="evenodd"
                    d="M6.243 11.004a.829.829 0 0 1-1.172 0L.65 6.585a.829.829 0 0 1 0-1.171l4.42-4.42a.829.829 0 0 1 1.172 1.172L2.41 6l3.833 3.834a.829.829 0 0 1 0 1.171Z"
                    clip-rule="evenodd"
                  />
                </svg>
              </button>
              <div class="font-bold text-lg">
                {{ currentSlide }}/<span class="text-gray-300">4</span>
              </div>
              <button
                @click="nextSlide"
                class="hove:bg-indigo-400 w-8 h-8 flex flex-col items-center justify-center text-white border-2 border-white bg-indigo-200 rounded-full"
              >
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  class="fill-current h-2.5 transform rotate-180"
                  viewBox="0 0 7 12"
                >
                  <path
                    fill-rule="evenodd"
                    d="M6.243 11.004a.829.829 0 0 1-1.172 0L.65 6.585a.829.829 0 0 1 0-1.171l4.42-4.42a.829.829 0 0 1 1.172 1.172L2.41 6l3.833 3.834a.829.829 0 0 1 0 1.171Z"
                    clip-rule="evenodd"
                  />
                </svg>
              </button>
            </div>
          </div>
          <Splide
            :options="splideOptions"
            class="mt-4"
            ref="splide"
            @splide:move="handleSlideMove"
          >
            <SplideSlide v-for="slide in slides" :key="slide.id">
              <img :src="slide.src" alt="" />
            </SplideSlide>
          </Splide>
        </div>
      </div>

      <div
        class="max-w-1687 mx-auto mt-0 xl:mt-11 flex flex-col lg:flex-row mt-12.5 lg:gap-6"
      >
        <div
          class="bg-violet-800 shadow-sm rounded-xl text-center lg:text-left py-10 px-6 text-white lg:py-9 lg:px-10 lg:w-7/12"
        >
          <h4 class="text-xl font-extrabold leading-tight">
            Приглашаем к сотрудничеству!
          </h4>
          <p class="text-sm leading-snug font-semibold mt-5">
            Мы приглашаем к сотрудничеству компании, заинтересованные в
            обучении, профориентации или курсах повышения квалификации для
            сотрудников, так и учебные заведения способные предложить
            современные и актуальные курсы по промышленным специальностям.
          </p>
          <button
            class="bg-indigo-200 rounded-xl h-9 text-gray-900 font-semibold mt-7.5 text-sm px-9"
          >
            Заполнить заявку
          </button>
        </div>
        <div
          class="text-center text-gray-500 pt-15 lg:w-5/12 lg:bg-white lg:rounded-xl lg:flex lg:flex-col lg:text-left lg:py-9 lg:px-10"
        >
          <h5 class="hidden lg:inline text-xl font-extrabold mb-5">
            Контакты для связи
          </h5>
          <p class="">
            Тел.: <a href="tel:+79998887766">+7 (999) 888-77-66</a>
          </p>
          <p class="mt-4">
            E-mail:
            <a href="mailto:my@promacademy.ru" class="underline"
              >my@promacademy.ru</a
            >
          </p>
          <div
            class="lg:flex lg:flex-row-reverse lg:mt-auto lg:w-full lg:justify-between"
          >
            <div
              class="flex mx-auto items-center justify-center mt-9 gap-7 lg:gap-2.5 lg:m-0"
            >
              <a href="#" class="text-violet-800">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  class="w-7.5 lg:w-6 fill-current"
                  viewBox="0 0 30 30"
                >
                  <path
                    d="M15 9.854a5.146 5.146 0 1 0 0 10.292 5.146 5.146 0 0 0 0-10.292Z"
                  />
                  <path
                    fill-rule="evenodd"
                    d="M6.719.879c5.46-.61 11.104-.61 16.563 0 3.006.336 5.43 2.704 5.783 5.72a72.31 72.31 0 0 1 0 16.801c-.353 3.017-2.777 5.385-5.783 5.721a75.16 75.16 0 0 1-16.563 0c-3.006-.336-5.43-2.704-5.783-5.72a72.313 72.313 0 0 1 0-16.801C1.289 3.583 3.713 1.215 6.719.879ZM22.917 5.5a1.583 1.583 0 1 0 0 3.167 1.583 1.583 0 0 0 0-3.167ZM7.48 15a7.52 7.52 0 1 1 15.041 0A7.52 7.52 0 0 1 7.48 15Z"
                    clip-rule="evenodd"
                  />
                </svg>
              </a>
              <a href="#" class="text-violet-800">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  class="w-8 lg:w-5 fill-current"
                  viewBox="0 0 34 21"
                >
                  <path
                    d="M32.047 20.103h-3.612c-1.367 0-1.778-1.107-4.23-3.558-2.138-2.062-3.042-2.32-3.584-2.32-.748 0-.953.206-.953 1.238v3.249c0 .879-.285 1.394-2.58 1.394a14.094 14.094 0 0 1-11.013-6.604 28.786 28.786 0 0 1-5.7-11.966C.375.994.581.504 1.613.504h3.61c.928 0 1.263.413 1.627 1.366 1.753 5.16 4.744 9.647 5.957 9.647.465 0 .668-.206.668-1.367V4.837c-.153-2.424-1.44-2.63-1.44-3.506a.891.891 0 0 1 .925-.827h5.675c.775 0 1.032.386 1.032 1.314v7.17c0 .776.335 1.033.567 1.033.466 0 .825-.257 1.677-1.109a29.71 29.71 0 0 0 4.436-7.378A1.555 1.555 0 0 1 27.92.504h3.612c1.082 0 1.312.542 1.082 1.314a45.073 45.073 0 0 1-4.848 8.332c-.388.594-.544.904 0 1.6.36.542 1.625 1.599 2.476 2.604a16.06 16.06 0 0 1 3.043 4.229c.31 1.005-.208 1.52-1.238 1.52Z"
                  />
                </svg>
              </a>
              <a href="#" class="text-violet-800">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  class="fill-current w-4 lg:w-2.5"
                  viewBox="0 0 17 30"
                >
                  <path
                    d="M12.484.552A7.323 7.323 0 0 0 5.16 7.875v4.077H1.242a.356.356 0 0 0-.356.357v5.383c0 .197.16.356.356.356h3.919v11.044c0 .197.16.356.356.356H10.9c.197 0 .357-.16.357-.356V18.048h3.953a.356.356 0 0 0 .346-.27l1.345-5.383a.356.356 0 0 0-.345-.443h-5.3V7.875a1.227 1.227 0 0 1 1.228-1.227H16.6c.197 0 .357-.16.357-.356V.908A.356.356 0 0 0 16.6.552h-4.116Z"
                  />
                </svg>
              </a>
            </div>
            <router-link
              :to="{ name: 'Home' }"
              class="flex mx-auto items-center justify-center gap-3.5 text-violet-800 mt-32 mb-8 lg:m-0"
            >
              <svg
                class="fill-current w-9 lg:w-5"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 24 24"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M8.491 0c6.131 0 6.538.02 7.087.342.844.496 1.145 1.186 1.145 2.627l-.021.321-5.24.064c-5.092.062-5.88.461-6.443.797-.328.195-.929.945-1.038 1.246-.125.345-.82 2.587-.62 5.773l.31 4.99-.627-.044c-.987 0-1.465-.086-1.9-.342C.007 15.106-.001 15.047 0 8.024c0-6.07.017-6.386.367-6.94C1.032.034 1.285 0 8.491 0Zm12.113 7.742s2.163.22 2.79.85l.537.54.052 6.461c.058 7.18.028 7.398-1.087 8.053-.574.337-.902.354-7.237.354-6.26 0-6.668-.02-7.217-.342-.844-.496-1.066-.758-1.1-2.199a7.46 7.46 0 0 0-.037-.592l-.053.001c.01-.298.031-.212.053-.001l5.09-.128c5.666-.141 6.752-.538 7.376-1.456.298-.437.875-1.682.956-6.395l-.123-5.146Zm-7.352.14h3.471v6.839l-.621.654-.623.654-3.652.055c-3.11.046-3.666.014-3.755-.21-.058-.144-.078-1.626-.045-3.294.052-2.595.111-3.112.404-3.58.655-1.042.983-1.118 4.821-1.118Z"
                />
              </svg>

              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="h-5.5 lg:h-4.5"
                fill="none"
                viewBox="0 0 205 27"
              >
                <path
                  fill="#51459D"
                  d="M17.619 6.56c0 1.085-.221 2.02-.663 2.806a5.242 5.242 0 0 1-1.801 1.898c-.795.506-1.705.872-2.73 1.097-1.015.226-2.158.34-3.43.34H7.458v5.407c0 .326.058.61.172.854.124.235.354.425.69.57.176.072.463.149.86.23.398.081.733.136 1.007.163v1.057H0v-1.057l1.02-.109c.424-.054.72-.117.888-.19.344-.144.57-.32.675-.528.115-.208.172-.497.172-.868V4.663c0-.317-.053-.588-.159-.814-.106-.235-.335-.429-.688-.582a4.878 4.878 0 0 0-.994-.285c-.406-.09-.71-.15-.914-.176V1.748h10.373c2.428 0 4.243.398 5.444 1.193 1.201.786 1.802 1.993 1.802 3.62Zm-5.167.692c0-1.446-.287-2.517-.86-3.213-.566-.705-1.577-1.057-3.034-1.057h-1.1v8.444h.557c1.448 0 2.547-.339 3.298-1.016.76-.687 1.14-1.74 1.14-3.158ZM32.071 10.017c0 .686-.207 1.292-.622 1.816-.415.515-.963.772-1.643.772-.645 0-1.192-.167-1.643-.501-.441-.334-.662-.827-.662-1.477 0-.317.022-.56.066-.732l.12-.502c-.407.018-.835.163-1.285.434a4.26 4.26 0 0 0-1.193 1.084v7.441c0 .317.049.579.146.787.097.207.26.37.49.488.195.099.508.185.94.257.442.063.76.1.955.108v.99h-8.863v-.99c.221-.018.442-.04.663-.067.23-.036.424-.082.582-.136.283-.1.477-.253.583-.46.106-.209.16-.48.16-.814v-7.889c0-.325-.076-.614-.226-.867a1.954 1.954 0 0 0-.543-.623 2.153 2.153 0 0 0-.61-.272 4.028 4.028 0 0 0-.794-.149v-.99l6.319-.352.198.204v1.965h.053c.61-.723 1.254-1.287 1.934-1.694.69-.416 1.405-.624 2.146-.624.822 0 1.48.262 1.974.787.504.515.755 1.183.755 2.006ZM46.524 9.136a6.222 6.222 0 0 1 1.497 2.236c.344.867.517 1.807.517 2.82a7.854 7.854 0 0 1-.517 2.846 6.163 6.163 0 0 1-1.484 2.277 7.093 7.093 0 0 1-2.503 1.558c-.963.362-2.067.543-3.312.543-1.078 0-2.071-.159-2.98-.475a6.97 6.97 0 0 1-2.398-1.423 6.463 6.463 0 0 1-1.59-2.236c-.389-.895-.583-1.893-.583-2.996 0-1.084.168-2.046.503-2.887a6.565 6.565 0 0 1 1.537-2.263c.654-.633 1.457-1.12 2.411-1.464.963-.353 2.036-.529 3.219-.529 1.236 0 2.323.176 3.259.529.945.343 1.753.831 2.424 1.464Zm-3.391 9.393c.194-.506.335-1.12.424-1.844.097-.723.145-1.563.145-2.52 0-.633-.044-1.356-.132-2.17-.088-.813-.22-1.454-.398-1.924-.211-.57-.507-1.017-.887-1.342-.37-.325-.843-.488-1.417-.488-.628 0-1.13.176-1.51.529-.372.352-.659.808-.862 1.369-.185.515-.313 1.12-.384 1.816-.07.687-.106 1.405-.106 2.155 0 .985.031 1.803.093 2.453a7.79 7.79 0 0 0 .45 1.939c.203.56.495 1.003.875 1.328.38.325.86.488 1.444.488.53 0 .984-.15 1.364-.448.38-.307.68-.754.9-1.341ZM76.569 20.982h-7.896v-.99c.195-.027.398-.05.61-.067.212-.018.388-.064.53-.136a.647.647 0 0 0 .37-.447 3.57 3.57 0 0 0 .08-.827v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.378-.705-.38 0-.72.063-1.02.19-.291.117-.56.266-.808.447-.256.19-.455.38-.596.57a34.1 34.1 0 0 0-.358.487v7.279c0 .325.036.592.106.8.08.198.221.357.424.474.141.081.3.154.477.217.185.063.38.108.583.136v.989h-7.564v-.99l.61-.067c.238-.027.414-.073.529-.136a.69.69 0 0 0 .358-.434c.061-.19.092-.47.092-.84v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.377-.705-.38 0-.72.063-1.02.19-.292.117-.561.266-.809.447-.256.19-.454.38-.596.57-.141.19-.26.352-.357.487v7.279c0 .316.04.578.119.786.08.208.22.37.424.488.141.081.3.154.477.217.185.063.38.108.583.136v.989h-7.936v-.99c.23-.018.455-.04.676-.067.22-.027.41-.073.57-.136.282-.108.477-.262.583-.46.106-.209.159-.48.159-.814v-7.889c0-.289-.076-.569-.226-.84a1.882 1.882 0 0 0-.543-.65 2.153 2.153 0 0 0-.61-.272 4.027 4.027 0 0 0-.794-.149v-.99l6.319-.352.199.204v1.91h.053l.874-.799c.344-.316.667-.569.967-.759.327-.217.746-.397 1.258-.542a6.178 6.178 0 0 1 1.683-.217c1.007 0 1.846.226 2.517.678a3.61 3.61 0 0 1 1.444 1.775h.119c.256-.243.57-.528.94-.853.371-.335.712-.601 1.02-.8.345-.226.782-.416 1.312-.57a6.253 6.253 0 0 1 1.722-.23c1.334 0 2.358.402 3.074 1.207.724.804 1.086 1.947 1.086 3.429v6.587c0 .334.048.605.145.813.098.2.274.353.53.461a3.9 3.9 0 0 0 1.245.325v.99Z"
                />
                <path
                  fill="#51459D"
                  d="M98.347 20.982h-10.24v-1.057a13.18 13.18 0 0 0 1.682-.258c.645-.144.967-.32.967-.528 0-.073-.008-.154-.026-.244a1.427 1.427 0 0 0-.106-.366l-1.603-3.985H82.53c-.15.37-.318.804-.504 1.3-.176.498-.33.94-.463 1.33-.168.505-.27.871-.305 1.097-.026.226-.04.384-.04.474 0 .29.212.538.636.746.433.199 1.148.343 2.146.434v1.057h-7.71v-1.057c.292-.018.619-.064.98-.136.372-.081.663-.19.875-.325.362-.217.667-.484.914-.8.256-.316.468-.691.636-1.125 1.024-2.539 2.049-5.083 3.073-7.63l3.418-8.432h2.65c1.73 4.356 3.086 7.799 4.066 10.329.98 2.53 1.815 4.626 2.504 6.289.115.271.26.52.437.745.177.217.429.425.755.624.248.144.535.253.862.325.326.072.622.118.887.136v1.057Zm-9.87-7.78L85.75 6.235l-2.69 6.967h5.419ZM105.951 21.416c-1.228 0-2.314-.181-3.259-.543-.936-.37-1.709-.872-2.318-1.504a6.156 6.156 0 0 1-1.365-2.277c-.3-.877-.45-1.83-.45-2.86 0-.94.181-1.834.543-2.684.371-.85.87-1.595 1.497-2.236.645-.66 1.444-1.184 2.398-1.573.962-.397 2.022-.596 3.179-.596 1.625 0 2.91.316 3.855.949.945.623 1.417 1.468 1.417 2.534 0 .651-.167 1.175-.503 1.573-.336.397-.914.596-1.735.596-.663 0-1.219-.162-1.669-.488-.442-.325-.663-.75-.663-1.274 0-.443.071-.88.212-1.315.141-.433.225-.763.252-.99a.969.969 0 0 0-.371-.365c-.15-.09-.384-.136-.702-.136-.398 0-.76.095-1.086.285-.327.19-.632.524-.914 1.003-.274.452-.495 1.057-.663 1.816-.159.76-.238 1.672-.238 2.738 0 1.609.366 2.905 1.099 3.89.742.985 1.625 1.478 2.65 1.478.98 0 1.757-.222 2.331-.664.583-.452 1.1-1.09 1.55-1.912l.994.705a7.91 7.91 0 0 1-.981 1.518 6.365 6.365 0 0 1-1.364 1.207c-.557.37-1.122.65-1.696.84-.574.19-1.241.285-2 .285ZM127.941 20.697c-.388.172-.848.33-1.378.475a6.355 6.355 0 0 1-1.682.217c-1.086 0-1.885-.163-2.398-.488-.512-.335-.861-.81-1.046-1.424h-.08c-.3.308-.591.57-.874.787a4.77 4.77 0 0 1-.888.555 5.87 5.87 0 0 1-1.205.434c-.38.1-.914.15-1.603.15-1.024 0-1.899-.308-2.623-.923-.724-.623-1.086-1.445-1.086-2.466 0-.588.079-1.085.238-1.491.159-.416.384-.782.676-1.098.265-.29.57-.529.914-.719.353-.19.737-.366 1.152-.528a37.344 37.344 0 0 1 2.862-.922c1.113-.325 1.925-.614 2.437-.867v-1.302c0-.226-.017-.524-.053-.894a2.934 2.934 0 0 0-.225-.935 1.775 1.775 0 0 0-.583-.732c-.265-.2-.614-.299-1.046-.299-.389 0-.716.06-.981.177a3.066 3.066 0 0 0-.622.338c.026.181.101.457.225.827.124.37.186.728.186 1.071 0 .154-.04.348-.12.583a1.287 1.287 0 0 1-.344.542c-.203.18-.433.32-.689.42-.247.1-.631.15-1.152.15-.742 0-1.303-.181-1.683-.543-.38-.37-.57-.85-.57-1.437 0-.506.195-.957.583-1.355a4.852 4.852 0 0 1 1.444-1.003 7.927 7.927 0 0 1 1.921-.624 9.751 9.751 0 0 1 2.014-.23c.856 0 1.642.054 2.358.163.715.1 1.36.311 1.934.637.547.316.98.777 1.298 1.382.327.597.49 1.378.49 2.345 0 1.021-.022 2.232-.066 3.633-.035 1.4-.053 2.322-.053 2.765 0 .406.057.727.172.962.124.235.309.411.557.529.15.072.384.117.702.135.326.01.622.014.887.014v.99Zm-6.584-7.061c-.494.171-.984.37-1.47.596a5.628 5.628 0 0 0-1.192.691 2.607 2.607 0 0 0-.769.976c-.185.389-.278.85-.278 1.383 0 .704.155 1.215.464 1.531a1.59 1.59 0 0 0 1.166.475c.485 0 .883-.1 1.192-.299.318-.207.596-.46.834-.759l.053-4.595ZM146.09 20.697l-6.531.393-.199-.19v-1.246l-.092-.027c-.433.478-1.021.899-1.762 1.26a5.09 5.09 0 0 1-2.226.529c-1.784 0-3.254-.678-4.411-2.034-1.157-1.355-1.736-3.108-1.736-5.259 0-1.906.645-3.542 1.935-4.906 1.298-1.365 2.865-2.047 4.702-2.047a7.8 7.8 0 0 1 2.04.258c.636.162 1.144.357 1.524.583V3.578a2.21 2.21 0 0 0-.199-.935 1.677 1.677 0 0 0-.53-.691c-.274-.199-.618-.339-1.033-.42a9.435 9.435 0 0 0-1.232-.19v-.99L143.493 0l.199.217v17.77c0 .343.053.632.159.867.115.235.296.42.543.556.186.099.455.171.808.216.362.046.658.073.888.082v.99Zm-6.756-2.412v-7.659a5.473 5.473 0 0 0-.265-.69 2.686 2.686 0 0 0-.451-.72 2.36 2.36 0 0 0-.715-.5 2.205 2.205 0 0 0-.993-.218c-.884 0-1.608.511-2.173 1.532s-.848 2.463-.848 4.324c0 .732.049 1.392.146 1.979a5.41 5.41 0 0 0 .543 1.586c.256.479.583.854.98 1.125.407.27.892.406 1.458.406.538 0 .984-.104 1.337-.311.354-.217.68-.502.981-.854ZM161.192 17.742a8.282 8.282 0 0 1-1.126 1.464c-.433.452-.928.84-1.484 1.166-.592.343-1.192.6-1.802.773-.6.18-1.294.27-2.08.27-1.307 0-2.437-.19-3.391-.569-.945-.38-1.726-.89-2.345-1.531a6.236 6.236 0 0 1-1.39-2.264 8.708 8.708 0 0 1-.451-2.846c0-.922.163-1.803.49-2.643a7.205 7.205 0 0 1 1.418-2.264c.6-.641 1.355-1.16 2.265-1.559.918-.397 1.943-.596 3.073-.596 1.237 0 2.252.154 3.047.46.795.308 1.453.733 1.974 1.275.503.515.87 1.125 1.1 1.83.229.696.344 1.428.344 2.196v.88h-8.955c0 1.853.349 3.263 1.046 4.23.698.966 1.806 1.45 3.325 1.45.831 0 1.577-.23 2.239-.691a6.551 6.551 0 0 0 1.696-1.776l1.007.745Zm-5.061-5.15c0-.542-.026-1.098-.079-1.667-.053-.57-.146-1.035-.278-1.396-.151-.425-.358-.746-.623-.963-.256-.217-.583-.325-.98-.325-.68 0-1.224.352-1.63 1.057-.406.705-.627 1.821-.662 3.348l4.252-.054ZM188.799 20.982h-7.896v-.99a11.6 11.6 0 0 1 .61-.067c.212-.018.388-.064.53-.136a.648.648 0 0 0 .371-.447c.053-.217.079-.493.079-.827v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.378-.705-.38 0-.72.063-1.02.19a3.724 3.724 0 0 0-.808.447 2.85 2.85 0 0 0-.596.57c-.141.19-.261.352-.358.487v7.279c0 .325.036.592.106.8.08.198.221.357.424.474.141.081.3.154.477.217.186.063.38.108.583.136v.989h-7.564v-.99l.609-.067c.239-.027.415-.073.53-.136a.688.688 0 0 0 .358-.434c.062-.19.092-.47.092-.84v-6.33c0-.93-.163-1.626-.49-2.087-.318-.47-.777-.705-1.377-.705-.38 0-.72.063-1.02.19a3.701 3.701 0 0 0-.808.447c-.257.19-.455.38-.597.57-.141.19-.26.352-.357.487v7.279c0 .316.039.578.119.786a.94.94 0 0 0 .424.488c.141.081.3.154.477.217.185.063.38.108.583.136v.989h-7.935v-.99c.229-.018.454-.04.675-.067.221-.027.411-.073.57-.136.282-.108.477-.262.583-.46.106-.209.159-.48.159-.814v-7.889c0-.289-.075-.569-.226-.84a1.88 1.88 0 0 0-.543-.65 2.154 2.154 0 0 0-.609-.272 4.015 4.015 0 0 0-.795-.149v-.99l6.319-.352.199.204v1.91h.053l.874-.799c.344-.316.667-.569.967-.759.327-.217.746-.397 1.259-.542a6.176 6.176 0 0 1 1.682-.217c1.007 0 1.846.226 2.517.678a3.612 3.612 0 0 1 1.444 1.775h.119c.256-.243.57-.528.941-.853a8.15 8.15 0 0 1 1.02-.8c.344-.226.781-.416 1.311-.57a6.256 6.256 0 0 1 1.722-.23c1.334 0 2.358.402 3.074 1.207.724.804 1.086 1.947 1.086 3.429v6.587c0 .334.048.605.146.813.097.2.273.353.529.461.142.063.314.127.517.19.212.063.455.108.729.136v.989ZM205 8.526a3.036 3.036 0 0 0-1.166.46c-.371.244-.68.624-.927 1.139a229.571 229.571 0 0 0-2.345 5.259 381.617 381.617 0 0 1-2.676 6.018c-.547 1.211-1.077 2.178-1.589 2.9-.513.724-.994 1.28-1.444 1.668-.424.361-.844.623-1.259.786a3.42 3.42 0 0 1-1.258.244c-.839 0-1.519-.24-2.04-.718-.513-.48-.769-1.017-.769-1.613 0-.253.027-.488.08-.705.062-.217.185-.443.371-.678.141-.199.357-.37.649-.515.3-.136.636-.203 1.007-.203.494 0 .967.176 1.417.528.45.353.919.84 1.404 1.464.292-.298.649-.745 1.073-1.342a6.402 6.402 0 0 0 .954-1.816 314.626 314.626 0 0 0-2.795-5.869 1870.85 1870.85 0 0 0-2.729-5.557 2.495 2.495 0 0 0-.888-1.003 2.772 2.772 0 0 0-1.179-.447v-.99h8.108v.99a3.908 3.908 0 0 0-1.047.203c-.388.126-.583.29-.583.488 0 .072.014.153.04.244.027.081.075.203.146.366.3.632.724 1.513 1.272 2.643.556 1.12 1.201 2.435 1.934 3.944a309.049 309.049 0 0 0 1.391-3.307c.388-.93.763-1.843 1.126-2.738.088-.226.136-.402.145-.529.018-.135.027-.226.027-.27 0-.163-.08-.303-.239-.42a2.132 2.132 0 0 0-.543-.326 3.959 3.959 0 0 0-.636-.204 6.409 6.409 0 0 0-.503-.094v-.99H205v.99Z"
                />
              </svg>
            </router-link>
          </div>
        </div>
      </div>
    </div>

    <transition name="fade">
      <div
        class="fixed flex flex-col items-center justify-center inset-x-0 bottom-0 top-13 md:top-0 py-7.5 px-6 z-10 bg-gray-700 bg-opacity-80"
        v-if="showingModal"
        @click="hideModal"
      >
        <div
          class="bg-white w-full max-w-930 px-10 py-8 rounded-2xl relative lg:px-20 lg:py-15"
        >
          <button
            class="text-gray-500 absolute top-6 right-6 lg:top-8 lg:right-8"
            @click="hideModal"
          >
            <svg
              xmlns="http://www.w3.org/2000/svg"
              fill="none"
              class="w-3.5 stroke-current"
              viewBox="0 0 16 16"
            >
              <path
                stroke-linecap="round"
                stroke-width="2"
                d="M1 15 15 1M15 15 1 1"
              />
            </svg>
          </button>
          <h4
            class="text-15 leading-tight font-extrabold md:text-xl lg:text-2xl"
          >
            Lorem ipsum dolor sit amet, consectetur adipiscing elit.
          </h4>
          <div class="lg:flex items-center gap-16">
            <img
              src="@/assets/img/test.svg"
              class="w-full h-auto mt-10 lg:w-5/12"
              alt=""
            />

            <div class="lg:w-7/12">
              <p class="text-sm mt-7.5 lg:mt-12 leading-tight md:text-lg">
                Viverra condimentum integer pellentesque dolor mi. Feugiat
                commodo consectetur aliquet pellentesque platea.
              </p>
              <p class="text-sm mt-3.5 leading-tight md:text-lg">
                Lorem ipsum dolor sit amet, consectetur adipiscing elit. Massa
                montes, sodales dolor dui faucibus justo, volutpat purus, amet.
                Neque laoreet leo quisque euismod bibendum amet. Sit libero sed
                amet, facilisis velit auctor lacinia. Volutpat eleifend purus,
                nec, eros est fringilla venenatis. Gravida orci senectus metus,
                lorem diam metus odio accumsan.
              </p>
            </div>
          </div>
        </div>
      </div>
    </transition>
  </div>
</template>

<script>
import { Splide, SplideSlide } from "@splidejs/vue-splide";

export default {
  name: "Home",

  components: {
    Splide,
    SplideSlide,
  },

  data() {
    return {
      showMenu: false,
      currentSlide: 1,
      splideOptions: {
        type: "loop",
        arrows: false,
        pagination: false,
        gap: "10px",
        fixedWidth: "auto",
        perPage: 3,
        breakpoints: {
          1024: {
            fixedWidth: "250px",
            padding: "45px",
            perPage: 3,
            pagination: true,
          },
        },
      },
      showingModal: false,
      slides: [
        {
          src: "https://api.lorem.space/image/movie?w=250&h=400",
          id: 1,
        },
        {
          src: "https://api.lorem.space/image/movie?w=250&h=400",
          id: 2,
        },
        {
          src: "https://api.lorem.space/image/movie?w=250&h=400",
          id: 3,
        },
        {
          src: "https://api.lorem.space/image/movie?w=250&h=400",
          id: 4,
        },
      ],
    };
  },

  methods: {
    nextSlide() {
      this.$refs.splide.go(">");
    },
    prevSlide() {
      this.$refs.splide.go("<");
    },
    handleSlideMove(splide, nextIndex) {
      this.currentSlide = nextIndex + 1;
    },
    showModal() {
      this.showingModal = true;
    },
    hideModal() {
      this.showingModal = false;
    },
  },
};
</script>
